# Площадь треугольника
# Напишите программу, которая считывает длины двух катетов в прямоугольном треугольнике и выводит его площадь.
# На вход программе подаётся два числа с плавающей точкой – длины катетов, каждое на отдельной строке.

a = float(input())
b = float(input())

print(1 / 2 * (a * b))
